// 题库
const allQuestions = [
    // 五十音，6题
    {
        question: "の",
        options: ["no", "ka", "wa", "i"],
        answer: 0
    },
    {
        question: "ン",
        options: ["so", "ri", "ha", "n"],
        answer: 3
    },
    {
        question: "wakuwaku",
        options: ["きらきら", "どきどき", "わくわく", "ばらばら"],
        answer: 2
    },
    {
        question: "homura",
        options: ["まどか", "ほむら", "さやか", "きょうこ"],
        answer: 1
    },
    {
        question: "tomori",
        options: ["ともり", "あのん", "らーな", "りっき"],
        answer: 0
    },
    {
        question: "bocchi",
        options: ["ぼっち", "ほっち", "はっち", "ばっち"],
        answer: 0
    },
    // 寒暄语，3题
    {
        question: "早上好",
        options: ["こんばんは", "こんにちは", "おはよう", "おやすみなさい"],
        answer: 2
    },
    {
        question: "谢谢",
        options: ["すみません", "ごめんなさい", "ありがとう", "いただきます"],
        answer: 2
    },
    {
        question: "再见",
        options: ["いってらっしゃい", "おかえりなさい", "お邪魔します", "じゃね"],
        answer: 3
    },
    // 动词变形，1题
    {
        question: "_____ください",
        options: ["食べます", "食べて", "食べる", "食べた"],
        answer: 1
    },
    // N5，5题
    {
        question: "涙の　【雨】が　頬を　たたく　たびに　美しく",
        options: ["ゆき", "はれ", "くもり", "あめ"],
        answer: 3
    },
    {
        question: "写真は　箱の　【中】に　あります。",
        options: ["そば", "そと", "なか", "よこ"],
        answer: 2
    },
    {
        question: "_____を　忘れましたから、時間が　わかりません。",
        options: ["辞書", "地図", "時計", "財布"],
        answer: 2
    },
    {
        question: "私は　明日の　飛行機　_____　国へ　帰ります。",
        options: ["に", "で", "か", "を"],
        answer: 1
    },
    {
        question: "昨日　スーパーで　田中さん　_____　会いました。",
        options: ["を", "に", "で", "の"],
        answer: 1
    },
    // N4，5题
    {
        question: "【色】は匂へど　散りぬるを",
        options: ["かたち", "あじ", "におい", "いろ"],
        answer: 3
    },
    {
        question: "その　意見には　【反対】です",
        options: ["はんたい", "ほんたい", "はんだい", "ほんだい"],
        answer: 0
    },
    {
        question: "明日は　サッカーの　【しあい】が　あります。",
        options: ["誡会", "誡合", "試会", "試合"],
        answer: 3
    },
    {
        question: "この　ロボットは　人　_____　会話することが　できます。",
        options: ["や", "を", "へ", "と"],
        answer: 3
    },
    {
        question: "娘は　先月　高校を　卒業しました。_____　大学の　入学式です。",
        options: ["だんだん", "あまり", "だいたい", "もうすぐ"],
        answer: 3
    },
    // N3，5题
    {
        question: "来年から【税金】が上がるそうだ。",
        options: ["ぜいきん", "ぜっきん", "せいきん", "せっきん"],
        answer: 0
    },
    {
        question: "【帰宅】後、少女がスマホを見ると、いつの間にか「Untitiled」という曲が入っていることに気づく。",
        options: ["きたく", "きったく", "かいたく", "かいだく"],
        answer: 0
    },
    {
        question: "あの時の私には分かりませんでしたが……今なら理解できます。\n大人としての、責任と【義務】。",
        options: ["ぎむ", "ぎぶつ", "いむ", "いぶつ"],
        answer: 0
    },
    {
        question: "バンドを組み様々な人たちに出会い、ひとりでは今まで見えてこなかった景色がそこには_____いた。",
        options: ["上がって", "かかって", "ついて", "広がって"],
        answer: 3
    },
    {
        question: "A: 地球にも私が_____か。\nB: 私にとって、あなたは地球の中心です。",
        options: ["含んでいます", "含まれています", "含めています", "含められています"],
        answer: 1
    },
    // N2，4题
    {
        question: "_____はいつもひとつ。",
        options: ["充実", "着実", "無実", "真実"],
        answer: 3
    },
    {
        question: "道は誰の【足跡】も付いていない新雪で覆おおわれてる。この辺りまでは人間が訪れる事は余り無いのだ。",
        options: ["そくせき", "そっせき", "あしあと", "あしもと"],
        answer: 2
    },
    {
        question: "海の底で眠る名もない私のだたひとつ芽吹いた【無垢】な心",
        options: ["ぶく", "むこう", "ぶこう", "むく"],
        answer: 3
    },
    {
        question: "私は雨というものが嫌いです。_____してますし、そこにいるだけで暗い気分になります。",
        options: ["きらきら", "ぺこぺこ", "くよくよ", "じめじめ"],
        answer: 3
    },

    // N1，4题
    {
        question: "期待する_____むなしいと分かっていても、救いを求め続けた。",
        options: ["しか", "のみ", "だけ", "きり"],
        answer: 2
    },
    {
        question: "香澄は有咲をバンドに誘う。しかし、学年一の秀才でありながら、学校もサボりがちなインドア派の有咲の態度は_____。",
        options: ["あどけない", "そっけない", "おっかない", "たわいない"],
        answer: 1
    },
    {
        question: "希望を抱くのが間違いだなんて言われたら、私、そんなのは違うって、何度でもそう_____。きっといつまでも言い張れます。",
        options: ["言い渡せます", "言い返せます", "引き渡せます", "取り返せます"],
        answer: 1
    },
    {
        question: "怒りも悩みも【綯い交ぜ】になっていた。",
        options: ["おいまぜ", "かいまぜ", "まいまぜ", "ないまぜ"],
        answer: 3
    },
    // N1+，7题
    {
        question: "【境内】",
        options: ["けいだい", "きょうない", "さかいうち", "さかいない"],
        answer: 0
    },
    {
        question: "これからの人生に幸_____ことを",
        options: ["多からん", "多からまほしき", "多しなる", "多かりまじき"],
        answer: 0
    },
    {
        question: "敵は_____にあり",
        options: ["吉祥寺", "西行寺", "花月総持寺", "本能寺"],
        answer: 3
    },
    {
        question: "すべて何者かが意図的に隠している、そんな気がします。\nいくらここを_____企業だとしても、ここまでやるのは不可能なはず。",
        options: ["逆鱗に触れている", "牛耳っている", "目論んでいる", "野次っている"],
        answer: 1
    },
    {
        question: "汽笛一声新橋を、はや我汽車は離れ_____。",
        options: ["たり", "なり", "ず", "じ"],
        answer: 0
    },
    {
        question: "世の中に、_____ _____ __★__ _____、春の心はのどけからまし。",
        options: ["せば", "絶えて", "なかり", "桜の花"],
        answer: 2
    },
    {
        question: "_____年、中国国内で日本語能力試験の実施が始まる。",
        options: ["1984", "1987", "1990", "1993"],
        answer: 3
    }
];